{"class_name": "Sequential", "keras_version": "1.2.2", "config": [{"class_name": "Convolution1D", "config": {"batch_input_shape": [null, 145, 4], "W_constraint": null, "b_constraint": null, "name": "convolution1d_10", "activity_regularizer": null, "trainable": true, "filter_length": 5, "init": "glorot_uniform", "bias": true, "nb_filter": 120, "input_dtype": "float32", "subsample_length": 1, "border_mode": "valid", "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "input_length": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_10"}}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_10", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": -1}}, {"class_name": "Dropout", "config": {"p": 0.1, "trainable": true, "name": "dropout_10"}}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution1d_11", "activity_regularizer": null, "trainable": true, "filter_length": 5, "init": "glorot_uniform", "bias": true, "nb_filter": 120, "input_dim": null, "subsample_length": 1, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "input_length": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_11"}}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_11", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": -1}}, {"class_name": "Dropout", "config": {"p": 0.1, "trainable": true, "name": "dropout_11"}}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution1d_12", "activity_regularizer": null, "trainable": true, "filter_length": 5, "init": "glorot_uniform", "bias": true, "nb_filter": 120, "input_dim": null, "subsample_length": 1, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "input_length": null}}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_12", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": -1}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_12"}}, {"class_name": "Dropout", "config": {"p": 0.1, "trainable": true, "name": "dropout_12"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_4"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_4", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 15960, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 12}}]}